trade_exp/src/DataProcessors/ПатерностерПроверкаНагрузки/ПатерностерПроверкаНагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПатерностерПроверкаНагрузки</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/Патерностеры/Патерностеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3347a283-ea6c-4862-9497-8f2154904bdb">
  <name>Патерностеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="28af626b-96d5-4031-ad57-dc748544f750">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="35574121-fd65-43c5-9c07-79d36fc4fc55">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3c7bf49b-4de8-4064-b841-59c59fda6fb4">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61b23e85-c677-44d9-a19b-6969f6adc4da">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Catalogs/Патерностеры/Патерностеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05a938bc-6220-416c-8cde-f88c973cbdee">
  <name>Патерностеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="8272bb98-1e99-4b2c-b747-761a7622b5c2">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da69e660-7b40-4918-97b0-ba2cd02dbd0a">
    <name>Патерностер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7078ea20-4b68-48d9-90af-59e07c81572a">
    <name>Вал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9dc125bc-2526-44d6-a2cb-40cacc6efd19">
    <name>ДопустимаяНагрузкаНаСтанок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1d1a5bd6-9694-4ab3-9043-7bbe8fea00e1">
    <name>ДопустимаяНагрузкаНаВал</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98c55f36-f1c1-45c3-95c9-c938e3aa5773">
    <name>ДисбалансПоСторонам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes extendedConfigurationObject="fe815fb5-1875-4130-acf3-35d54b6300d2">
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="57ed9ee0-517f-4fb9-bc74-2d8fcd4d0a4b">
    <name>НоменклатураМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4dc73fe7-64ac-43ce-ab0c-df92d01c6311">
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e0d07478-37ac-42f6-a26a-04f4fa4c4743">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebb5bfee-de18-4d14-a24f-e32cbdd90cf9">
    <name>Безразмерная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="23aae39e-0410-48bc-917a-96177b6e468b">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7f52563-0c7c-4de6-ac07-6ef01ff7688d">
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="35306e02-2ad1-4232-a398-068a769610be">
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be5c2342-1fad-40cf-b4f7-a1017bc7e542">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af87b08a-d7f9-4ad8-9eec-e3f927c89172">
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df4a78ba-9180-411a-943d-2eaf96f21d69">
    <name>СкладскаяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba8289fe-be8a-45a4-819c-2c2f84c4de2f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5aa38e35-acdf-4eae-a145-4407937beec7">
    <name>ХарактеристикаМногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f74a4575-a405-4411-b8a1-f7dda30e2967">
    <name>Глубина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="922b22b5-b814-4d15-b669-ded6f1e11a61">
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7304712c-4a4e-40e0-be6c-a895e78d8825">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f2cd6a4-d354-43cb-b6e5-9f43829d8bc3">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7b61ba6a-896e-4ef0-98cc-bb012362f16c">
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1306a2c8-039b-4b1b-a808-f8fc27b47f72">
    <name>Ширина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0192ca1-e274-4de7-a7bd-ffca9512f173">
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c40dec99-d7f0-45f7-94f9-5288383ea7f7">
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="993b535f-c665-4cc4-b466-d11667bec4fa">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4378e490-1e5e-4dd6-a3db-03d426ec7986">
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПатерностерПроверкаНагрузки/Forms/Форма/Module.bsl
&НаСервере
Процедура ПроверитьНаСервере() 
	Проверка.Очистить();
	Если ПервыйВал = 0 Тогда
		Сообщить("Первый вал должен быть больше 0!"); 
		Возврат;
	КонецЕсли;	
	Если Патерностер = 0 Тогда
		Сообщить("Патерностер должен быть больше 0!"); 
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Выберите склад!");
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;  
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Патерностеры.Ссылка КАК Патерностер,
		|	Патерностеры.Вал КАК Вал,
		|	Патерностеры.ДопустимаяНагрузкаНаСтанок КАК ДопустимаяНагрузкаНаСтанок,
		|	Патерностеры.ДопустимаяНагрузкаНаВал КАК ДопустимаяНагрузкаНаВал,
		|	Патерностеры.ДисбалансПоСторонам КАК ДисбалансПоСторонам,
		|	РегистрПатерностеры.Характеристика КАК Характеристика,
		|	РегистрПатерностеры.Номенклатура КАК Номенклатура,
		|	Патерностеры.Склад КАК Склад,
		|	&Вес КАК Вес
		|ПОМЕСТИТЬ ВТ_Патерностер
		|ИЗ
		|	Справочник.Патерностеры КАК Патерностеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Патерностеры КАК РегистрПатерностеры
		|		ПО (РегистрПатерностеры.Патерностер = Патерностеры.Ссылка)
		|ГДЕ
		|	Патерностеры.Склад = &Склад
		|	И Патерностеры.Патерностер = &Патерностер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Патерностер.Патерностер КАК Патерностер,
		|	ВТ_Патерностер.Вал КАК Вал,
		|	ВТ_Патерностер.ДопустимаяНагрузкаНаСтанок КАК ДопустимаяНагрузкаНаСтанок,
		|	ВТ_Патерностер.ДопустимаяНагрузкаНаВал КАК ДопустимаяНагрузкаНаВал,
		|	ВТ_Патерностер.ДисбалансПоСторонам КАК ДисбалансПоСторонам,
		|	ВТ_Патерностер.Характеристика КАК Характеристика,
		|	ВТ_Патерностер.Номенклатура КАК Номенклатура,
		|	ВТ_Патерностер.Склад КАК Склад,
		|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК Остаток,
		|	ВТ_Патерностер.Вес * СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК Вес
		|ИЗ
		|	ВТ_Патерностер КАК ВТ_Патерностер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(, ) КАК ЗапасыИПотребностиОстатки
		|		ПО (ЗапасыИПотребностиОстатки.Номенклатура = ВТ_Патерностер.Номенклатура)
		|			И (ЗапасыИПотребностиОстатки.Характеристика = ВТ_Патерностер.Характеристика)
		|			И (ЗапасыИПотребностиОстатки.Склад = ВТ_Патерностер.Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Патерностер.Патерностер,
		|	ВТ_Патерностер.Вал,
		|	ВТ_Патерностер.ДопустимаяНагрузкаНаСтанок,
		|	ВТ_Патерностер.ДопустимаяНагрузкаНаВал,
		|	ВТ_Патерностер.ДисбалансПоСторонам,
		|	ВТ_Патерностер.Характеристика,
		|	ВТ_Патерностер.Номенклатура,
		|	ВТ_Патерностер.Склад,
		|	ВТ_Патерностер.Вес
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вал
		|ИТОГИ
		|	КОЛИЧЕСТВО(Вал)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Вес", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("РегистрПатерностеры.Номенклатура.ЕдиницаИзмерения", "РегистрПатерностеры.Номенклатура", Ложь));
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Патерностер", Патерностер);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("Патерностер");
	ТаблицаПроверки.Колонки.Добавить("Вал",Новый ОписаниеТипов("Число"));  
	ТаблицаПроверки.Колонки.Добавить("Остаток",Новый ОписаниеТипов("Число"));
	ТаблицаПроверки.Колонки.Добавить("Вес",Новый ОписаниеТипов("Число"));
	ТаблицаПроверки.Колонки.Добавить("ДопустимаяНагрузкаНаСтанок",Новый ОписаниеТипов("Число")); 
	ТаблицаПроверки.Колонки.Добавить("ДопустимаяНагрузкаНаВал",Новый ОписаниеТипов("Число"));
	ТаблицаПроверки.Колонки.Добавить("ДисбалансПоСторонам",Новый ОписаниеТипов("Число"));
	ТаблицаПроверки.Колонки.Добавить("Номенклатура");   
	ТаблицаПроверки.Колонки.Добавить("Характеристика"); 
	
	ВыборкаОбщие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
	
	Если ВыборкаОбщие.Следующий() Тогда   
		ВсегоВалов = ВыборкаОбщие.Вал;
		Выборка = ВыборкаОбщие.Выбрать();
		Пока Выборка.Следующий() Цикл        
			СтрокаПоверки = ТаблицаПроверки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПоверки,Выборка);  
		КонецЦикла;
	КонецЕсли;
	
	// Вывести отчет
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");   
	ОбластьДисбаланс = Макет.ПолучитьОбласть("Дисбаланс");
	
	ВывестиШапку = 0; 
	
	//ПоловинаВалов = Цел(ВсегоВалов/2);
	ПоловинаВалов = ?(Цел(ВсегоВалов/2) = ВсегоВалов/2, ВсегоВалов/2, Цел(ВсегоВалов/2) + 1);
	ВсегоВес1 = 0; 
	ВсегоВес2 = 0;
	Для Н=0 По  ПоловинаВалов-1  Цикл
		Если ВывестиШапку = 0 Тогда  
			ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,ТаблицаПроверки[0]);  
			Проверка.Вывести(ОбластьШапка);
			ВывестиШапку = 1;	
		КонецЕсли;
		
		Н1=Н+ПервыйВал;  
		Если Н1>ВсегоВалов Тогда
			Н1=Н1-ВсегоВалов;
		КонецЕсли;	
		
		Н2=Н1+ПоловинаВалов;
		Если Н2>ВсегоВалов Тогда
			Н2=Н2-ВсегоВалов;
		КонецЕсли;	
		
		ОбластьСтрока.Параметры.НомерВала1 = ТаблицаПроверки[Н1-1].Вал; 
		ОбластьСтрока.Параметры.Номенклатура1 = СтрШаблон("%1 %2",ТаблицаПроверки[Н1-1].Номенклатура, ТаблицаПроверки[Н1-1].Характеристика);
		ОбластьСтрока.Параметры.Остаток1 = ТаблицаПроверки[Н1-1].Остаток;
		ОбластьСтрока.Параметры.Вес1 = ТаблицаПроверки[Н1-1].Вес;   
		ВсегоВес1 = ВсегоВес1 + ТаблицаПроверки[Н1-1].Вес; 
		ОбластьСтрока.Параметры.РасшифровкаНоменклатура1 = Новый Структура("Номенклатура, Характеристика", ТаблицаПроверки[Н1-1].Номенклатура, ТаблицаПроверки[Н1-1].Характеристика);
		
		Если Н < ПоловинаВалов-1 или ПоловинаВалов=Цел(ВсегоВалов/2) Тогда
		ОбластьСтрока.Параметры.НомерВала2 = ТаблицаПроверки[Н2-1].Вал; 
		ОбластьСтрока.Параметры.Номенклатура2 = СтрШаблон("%1 %2",ТаблицаПроверки[Н2-1].Номенклатура, ТаблицаПроверки[Н2-1].Характеристика);
		ОбластьСтрока.Параметры.Остаток2 = ТаблицаПроверки[Н2-1].Остаток;
		ОбластьСтрока.Параметры.Вес2 = ТаблицаПроверки[Н2-1].Вес; 
		ВсегоВес2 = ВсегоВес2 + ТаблицаПроверки[Н2-1].Вес;     
		ОбластьСтрока.Параметры.РасшифровкаНоменклатура2 = Новый Структура("Номенклатура, Характеристика", ТаблицаПроверки[Н2-1].Номенклатура, ТаблицаПроверки[Н2-1].Характеристика);
		Иначе
		ОбластьСтрока.Параметры.НомерВала2 = ""; 
		ОбластьСтрока.Параметры.Номенклатура2 = "";
		ОбластьСтрока.Параметры.Остаток2 = "";
		ОбластьСтрока.Параметры.Вес2 = ""; 
		ОбластьСтрока.Параметры.РасшифровкаНоменклатура2 = "";
		КонецЕсли;
	
		Если ТаблицаПроверки[Н1-1].Вес > ТаблицаПроверки[Н1-1].ДопустимаяНагрузкаНаВал Тогда   
			Сообщить(СтрШаблон("Превышение веса на %1 валу на %2 кг.",Н1,ТаблицаПроверки[Н1-1].Вес - ТаблицаПроверки[Н1-1].ДопустимаяНагрузкаНаВал));
		КонецЕсли;	     
		
		Если Н < ПоловинаВалов-1 или ПоловинаВалов=Цел(ВсегоВалов/2) Тогда
		Если ТаблицаПроверки[Н2-1].Вес > ТаблицаПроверки[Н2-1].ДопустимаяНагрузкаНаВал Тогда   
			Сообщить(СтрШаблон("Превышение веса на %1 валу на %2 кг.",Н2,ТаблицаПроверки[Н2-1].Вес - ТаблицаПроверки[Н2-1].ДопустимаяНагрузкаНаВал));
		КонецЕсли;
		КонецЕсли;
		
		Проверка.Вывести(ОбластьСтрока);
	КонецЦикла;           
	ОбластьПодвал.Параметры.ВсегоВес1 = ВсегоВес1;  
	ОбластьПодвал.Параметры.ВсегоВес2 = ВсегоВес2; 
	Проверка.Вывести(ОбластьПодвал);       
	
	Если Макс(ВсегоВес1 - ВсегоВес2,ВсегоВес2 - ВсегоВес1) > ТаблицаПроверки[0].ДисбалансПоСторонам Тогда   
		Сообщить(СтрШаблон("Дисбаланс по сторонам на %1 кг.", Макс(ВсегоВес1 - ВсегоВес2,ВсегоВес2 - ВсегоВес1)));
	КонецЕсли;
	Если ВсегоВес1 + ВсегоВес2 > ТаблицаПроверки[0].ДопустимаяНагрузкаНаСтанок Тогда   
		Сообщить(СтрШаблон("Превышение общего веса на %1 кг.", ВсегоВес1 + ВсегоВес2 - ТаблицаПроверки[0].ДопустимаяНагрузкаНаСтанок));
	КонецЕсли; 
	//--
	
	// Проверить дисбаланс по всем вариантам размещения валов   
	ВалыДисбаланс = "";
	
	Для Сч=1 По ВсегоВалов Цикл
	ПервыйВалПроверка = Сч;
		ВсегоВес1 = 0; 
		ВсегоВес2 = 0;     
		
		Для Н=0 По  ПоловинаВалов-1  Цикл
			
			Н1=Н+ПервыйВалПроверка;  
			Если Н1>ВсегоВалов Тогда
				Н1=Н1-ВсегоВалов;
			КонецЕсли;	
			
			Н2=Н1+ПоловинаВалов;
			Если Н2>ВсегоВалов Тогда
				Н2=Н2-ВсегоВалов;
			КонецЕсли;	
			
			ВсегоВес1 = ВсегоВес1 + ТаблицаПроверки[Н1-1].Вес;
			
			Если Н < ПоловинаВалов-1 или ПоловинаВалов=Цел(ВсегоВалов/2) Тогда
            ВсегоВес2 = ВсегоВес2 + ТаблицаПроверки[Н2-1].Вес;
			КонецЕсли;
		
		КонецЦикла;           
		
		Если Макс(ВсегоВес1 - ВсегоВес2,ВсегоВес2 - ВсегоВес1) > ТаблицаПроверки[0].ДисбалансПоСторонам Тогда   
			Если ВалыДисбаланс = "" Тогда 
				ВалыДисбаланс = Строка(Сч);
			Иначе
				ВалыДисбаланс = СтрШаблон("%1, %2",ВалыДисбаланс,Строка(Сч));
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Если ВалыДисбаланс <> "" Тогда
		ОбластьДисбаланс.Параметры.ВалыДисбаланс = ВалыДисбаланс; 
		Проверка.Вывести(ОбластьДисбаланс);       
	КонецЕсли;	
	//--
	Иначе
		Сообщить("Не найдена информация по патерностерам");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда) 
	ОчиститьСообщения();
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;  
	КонецЕсли;
	Если Параметры.Свойство("Патерностер") Тогда
		Патерностер = Параметры.Патерностер;  
	КонецЕсли;
	ПервыйВал = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;     
	ЗначениеОтбора = Новый Структура("Склад, Номенклатура, Характеристика", Склад, Расшифровка.Номенклатура, Расшифровка.Характеристика);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ФормаРегистра = ПолучитьФорму("РегистрСведений.Патерностеры.ФормаСписка",ПараметрыВыбора);
	ФормаРегистра.Открыть();
КонецПроцедуры
